Revit 2026 API

# FormattedTextGetIndentLevel Method

---

Returns the indent level of the paragraphs in the text range.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetIndentLevel(
	TextRange textRange
)
```
```vb
Public Function GetIndentLevel (
	textRange As TextRange
) As Integer
```
```cpp
public:
int GetIndentLevel(
	TextRange^ textRange
)
```
```fsharp
member GetIndentLevel :
        textRange : TextRange -> int
```

#### Parameters

textRange TextRange
     The given text range.

#### Return Value

Int32 The indentation level of the paragraphs in the range.

| Exception | Condition |
| --- | --- |
| ArgumentException | This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text. |
| ArgumentNullException | A non-optional argument was null |

Returns -1 if the range contains multiple paragraphs with different indent levels.

#### Reference

FormattedText Class

Autodesk.Revit.DB Namespace